// 6262:流感传染
// 总时间限制: 1000ms 内存限制: 65536kB
// 描述
// 有一批易感人群住在网格状的宿舍区内，宿舍区为n*n的矩阵，
// 每个格点为一个房间，房间里可能住人，也可能空着。
// 在第一天，有些房间里的人得了流感，
// 以后每天，得流感的人会使其邻居传染上流感，（已经得病的不变），
// 空房间不会传染。请输出第m天得流感的人数。

// 输入
// 第一行一个数字n，n不超过100，表示有n*n的宿舍房间。
// 接下来的n行，每行n个字符，’.’表示第一天该房间住着健康的人，
// ’#’表示该房间空着，’@’表示第一天该房间住着得流感的人。
// 接下来的一行是一个整数m，m不超过100.
// 输出
// 输出第m天，得流感的人数
// 样例输入
// 5
// ....#
// .#.@.
// .#@..
// #....
// .....
// 4
// 样例输出
// 16
// http://noi.openjudge.cn/ch0203/6262/

#include<bits/stdc++.h>
using namespace std;
int a[101][101]; // -1 表示房间为空，1表示房间有人，0表示房间有人且得流感
int main(){
    int n, m;
    char c;
    cin>>n;
    for(int i=1; i<=n; i++){
        for(int j=1; j<=n; j++){
            cin>>c;
            if(c=='.'){
                a[i][j]=1;
            }
            else if(c=='@'){
                a[i][j]=0;
            }
            else{
                a[i][j]=-1;
            }
        }
    }
    cin>>m;
    for(int k=2; k<=m; k++){
        for(int i=1; i<=n; i++){
            for(int j=1; j<=n; j++){
                if(a[i][j]==0){
                    if(a[i][j+1]==1)
                        a[i][j+1] = -2;   // 设置为-2表示该房间已经得流感，防止重复计算
                    if(a[i][j-1]==1)
                        a[i][j-1] = -2;
                    if(a[i+1][j]==1)
                        a[i+1][j] = -2;
                    if(a[i-1][j]==1)
                        a[i-1][j] = -2;
                }
            }
        }
        for(int i=1; i<=n; i++){
            for(int j=1; j<=n; j++){
                if(a[i][j]==-2){
                    a[i][j] = 0;
                }
            }
        }
    }
    int count=0;
    for(int i=1; i<=n; i++){
        for(int j=1; j<=n; j++){
            if(a[i][j]==0){
                count++;
            }
        }
    }
    cout<<count<<endl;
    return 0;
}